<h3>Example<h3>

**hiring.csv**. This file contains hiring statics for a firm such as experience of candidate, his written test score and personal interview score. Based on these 3 factors, HR will decide the salary. Given this data, you need to build a machine learning model for HR department that can help them decide salaries for future candidates. Using this predict salaries for following candidates,


* 2 yr experience, 9 test score, 6 interview score**

* 12 yr experience, 10 test score, 10 interview score**

<h5>1)Import Modules<h5>

In [30]:
import pandas as pd
import numpy as np
import math
import matplotlib.pyplot as plt
from sklearn import linear_model
from word2number import w2n

<h5>2)Import dataset<h5>

In [31]:
df=pd.read_csv('hiring.csv')
df

  experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         NaN                7   72000
7     eleven         7.0                8   80000

<h5>3)Data Processing: filling Na with median<h5>

In [32]:
score_median=math.floor(df.test_score.median())
score_median

8

In [33]:
df.test_score=df.test_score.fillna(score_median)
df.experience=df.experience.fillna(0)

In [34]:
df

  experience  test_score  interview_score  salary
0          0         8.0                9   50000
1          0         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         8.0                7   72000
7     eleven         7.0                8   80000

In [37]:
# Convert the 'experience' column values to strings
df['experience'] = df['experience'].astype(str)

# Apply word_to_num function to convert string words to numbers
df['experience'] = df['experience'].apply(lambda x: w2n.word_to_num(x))
df

   experience  test_score  interview_score  salary
0           0         8.0                9   50000
1           0         8.0                6   45000
2           5         6.0                7   60000
3           2        10.0               10   65000
4           7         9.0                6   70000
5           3         7.0               10   62000
6          10         8.0                7   72000
7          11         7.0                8   80000

<h5>4)Create regression object of LinearRegression Class<h5>

* y (dependent varibale)= m1(coefficient) * x (independnent variables) + b
* Salary = m1 * experience + m2 * test_score + m3 * interview_score + Intercept

In [38]:
reg=linear_model.LinearRegression()

<h5>5)Train the model uisng training set<h5>

In [39]:
reg.fit(df[['experience','test_score','interview_score']], df.salary)

LinearRegression()

<h5>6) Now you can predict dependent value for any set of independent values<h5>


* 2 yr experience, 9 test score, 6 interview score

In [42]:
Salary_candidate1=reg.predict(np.array([[2,9,6]]))
Salary_candidate1

array([53205.96797671])

* 12 yr experience, 10 test score, 10 interview score

In [44]:
Salary_candidate2 =math.floor(reg.predict(np.array([[12,10,10]])))
Salary_candidate2

92002